Revit 2024 API
BuiltInFailures.CurtainWallFailures.GridlinesOutOfBounds Property
 Manually placed curtain grid lines are on the wall edges or outside the wall boundaries.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId GridlinesOutOfBounds { get; }
Visual Basic
Public Shared ReadOnly Property GridlinesOutOfBounds As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ GridlinesOutOfBounds {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace